#+TITLE: Using Emacs and Org to publish a blog
#+SUBTITLE: I converted my blog from Jekyll to be published using Emacs and Org. To say it was an interesting endeavor is an understatement.
#+DATE: <2019-03-20>
#+OPTIONS: ^:nil

Wiring up your own static site creator could be seen as a rite of passage for
the modern programmer. The ultimate [[http://catb.org/jargon/html/Y/yak-shaving.html][yak shave]], I ended up redoing the static
site generation engine for this blog using [[https://orgmode.org/][Org mode.]] Org is an [[https://www.gnu.org/software/emacs/][Emacs]] package for
many, many things. One of these is [[https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html][publishing HTML pages]], so it can be used to
generate static HTML sites. This document details the process I went through
doing the conversion, and explains the background and reasoning for them.

#+TOC: headlines 3

** The directory structure

I split the output into =out= and the code lives inside =src=. This is the
directory structure, provided by calling =tree= from Babel:

#+begin_src shell :results output :exports results
tree -a -I "out|.git" -L 3 ../../ | tail -n +2 
#+end_src

#+RESULTS:
#+begin_example
|-- .dir-locals.el
|-- config.el
|-- config.org
`-- src
    |-- about.org
    |-- archive.org
    |-- assets
    |   |-- hylo.js
    |   |-- hyphenator.js
    |   |-- images
    |   `-- style.css
    |-- index.org
    `-- posts
        |-- configuration.org
        |-- emacs-and-org.org
        `-- pieru.org

4 directories, 12 files
#+end_example

The =src= directory is the source of the blog, and the =out= directory contains
the static HTML to be uploaded.

#+INCLUDE: "../../config.org" :minlevel 2

